In [1]:
import pandas as pd

In [3]:
series_data=[1,2,3,4]

In [5]:
series=pd.Series(series_data)

In [7]:
series

0    1
1    2
2    3
3    4
dtype: int64

In [9]:
type(series)

pandas.core.series.Series

In [11]:
series[1]

2

In [15]:
b=pd.Series([1,2,3,4],index=['a','b','c','d'])

In [17]:
b

a    1
b    2
c    3
d    4
dtype: int64

In [19]:
b['a']

1

In [21]:
b[2]

C:\Users\USER\AppData\Local\Temp\ipykernel_8748\2083252473.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  b[2]

3

In [23]:
c=pd.Series([23,32,45,67],index=['1','2','3','4'])

In [25]:
c

1    23
2    32
3    45
4    67
dtype: int64

In [27]:
c[0]

C:\Users\USER\AppData\Local\Temp\ipykernel_8748\4192214634.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  c[0]

23

In [29]:
c[1]

C:\Users\USER\AppData\Local\Temp\ipykernel_8748\16272379.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  c[1]

32

In [31]:
c.loc['1']

23

In [33]:
c['1']

23

In [35]:
c.iloc[1]

32

In [37]:
b.iloc[1]#return the index value

2

In [39]:
b.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [41]:
c.index

Index(['1', '2', '3', '4'], dtype='object')

In [43]:
#create a series which has index of five student name  and values as their roll number
student=pd.Series([1,2,3,4,5],index=['Rosan','sneha','ankit','bardan','bipin'])

In [45]:
student

Rosan     1
sneha     2
ankit     3
bardan    4
bipin     5
dtype: int64

In [54]:
student.loc['Rosan']

1

In [58]:
student.iloc[2]

3

In [62]:
student.loc['ankit']

3

In [64]:
student.index

Index(['Rosan', 'sneha', 'ankit', 'bardan', 'bipin'], dtype='object')

In [68]:
student.iloc[:4]

Rosan     1
sneha     2
ankit     3
bardan    4
dtype: int64

In [72]:
student.values

array([1, 2, 3, 4, 5], dtype=int64)

In [74]:
b

a    1
b    2
c    3
d    4
dtype: int64

In [76]:
b*2

a    2
b    4
c    6
d    8
dtype: int64

In [78]:
b>1

a    False
b     True
c     True
d     True
dtype: bool

In [80]:
new_b=b[b>1]

In [82]:
new_b

b    2
c    3
d    4
dtype: int64

In [84]:
#create a series of marks which has index as students name (10 students
marks=pd.Series([80,40,50,70,90,97,56,89,90,80],index=['ram','shyam','sita','sneha','rosan','meesha','himal','bardan','ankit','bipin'])

In [86]:
marks

ram       80
shyam     40
sita      50
sneha     70
rosan     90
meesha    97
himal     56
bardan    89
ankit     90
bipin     80
dtype: int64

In [88]:
marks.loc['sneha']

70

In [90]:
marks.iloc[4]#it takes the default indexing

90

In [94]:
marks.loc['rosan']

90

In [104]:
marks.iloc[9]

80

In [98]:
new_marks=marks[marks>80

In [100]:
new_marks

rosan     90
meesha    97
bardan    89
ankit     90
dtype: int64

In [106]:
data={'Name':['Ram','Hari','shyam'],
      'Age':[25,30,35],
      'city':['kathmandu','pakhara','biratnagar']}

In [108]:
df=pd.DataFrame(data)

In [110]:
df

    Name  Age        city
0    Ram   25   kathmandu
1   Hari   30     pakhara
2  shyam   35  biratnagar

In [112]:
df.iloc[0]

Name          Ram
Age            25
city    kathmandu
Name: 0, dtype: object

In [124]:
df.iloc[0,1]

25

In [130]:
df.iloc[0].loc['Age']

25

In [132]:
#create a recor of 10 employeees  using dictionary which contains name,age,salary,address as keys and appropriate values as values
employee={
    'name':['ram','shyam','sneha','rosan','bardan','ankit','meesha','bipin','kamal','kp'],
    'age':[12,23,34,,45,56,67,78,67,75,44],
    'salary':[1000,20000,10000,4200,5200,65600,5500,65000,6000,800000],
    'address':['ktm','pkr','bktt','ltr','abc','dfa','asdfa','ramechhap','dhangadi','banep']}

SyntaxError: invalid syntax (1399381794.py, line 4)

In [134]:
d=[{'name':'Rosan','age':12,'salary':4000,'address':'4rt'},
   {'name':'sneha','age':72,'salary':1000,'address':'frt'},
   {'name':'ankit','age':82,'salary':2000,'address':'4fdsrt'},
   {'name':'ankit','age':82,'salary':44000,'address':'fgrt'},
   {'name':'bardan','age':72,'salary':45000,'address':'dsf4rt'},
   {'name':'bipin','age':62,'salary':40600,'address':'ds4rt'},
   {'name':'dsaf','age':52,'salary':45000,'address':'dsg4rt'},
   {'name':'df','age':32,'salary':46000,'address':'sd4rt'},
   {'name':'hrr','age':22,'salary':40700,'address':'4ertrt'}]

In [136]:
d

[{'name': 'Rosan', 'age': 12, 'salary': 4000, 'address': '4rt'},
 {'name': 'sneha', 'age': 12, 'salary': 1000, 'address': '4rt'},
 {'name': 'ankit', 'age': 12, 'salary': 2000, 'address': '4rt'},
 {'name': 'ankit', 'age': 12, 'salary': 44000, 'address': '4rt'},
 {'name': 'bardan', 'age': 12, 'salary': 45000, 'address': '4rt'},
 {'name': 'bipin', 'age': 12, 'salary': 40600, 'address': '4rt'},
 {'name': 'dsaf', 'age': 12, 'salary': 45000, 'address': '4rt'},
 {'name': 'df', 'age': 12, 'salary': 46000, 'address': '4rt'},
 {'name': 'hrr', 'age': 22, 'salary': 40700, 'address': '4rt'}]

AttributeError: 'list' object has no attribute 'head'

In [140]:
emp_df=pd.DataFrame(d)

In [142]:
emp_df

     name  age  salary address
0   Rosan   12    4000     4rt
1   sneha   12    1000     4rt
2   ankit   12    2000     4rt
3   ankit   12   44000     4rt
4  bardan   12   45000     4rt
5   bipin   12   40600     4rt
6    dsaf   12   45000     4rt
7      df   12   46000     4rt
8     hrr   22   40700     4rt

In [144]:
emp_df.head()

     name  age  salary address
0   Rosan   12    4000     4rt
1   sneha   12    1000     4rt
2   ankit   12    2000     4rt
3   ankit   12   44000     4rt
4  bardan   12   45000     4rt

In [146]:
emp_df.tail()

     name  age  salary address
4  bardan   12   45000     4rt
5   bipin   12   40600     4rt
6    dsaf   12   45000     4rt
7      df   12   46000     4rt
8     hrr   22   40700     4rt

In [148]:
#create a new employee df which contains emp record having salary more than 50k

In [158]:
emp_df['salary']>500

0    True
1    True
2    True
3    True
4    True
5    True
6    True
7    True
8    True
Name: salary, dtype: bool

In [178]:
emp_df[emp_df['salary']>20000]

     name  age  salary address
3   ankit   12   44000     4rt
4  bardan   12   45000     4rt
5   bipin   12   40600     4rt
6    dsaf   12   45000     4rt
7      df   12   46000     4rt
8     hrr   22   40700     4rt

In [174]:
emp_df[pd.Series(['name','salary'])]

     name  salary
0   Rosan    4000
1   sneha    1000
2   ankit    2000
3   ankit   44000
4  bardan   45000
5   bipin   40600
6    dsaf   45000
7      df   46000
8     hrr   40700

In [180]:
emp_df[['name']]

     name
0   Rosan
1   sneha
2   ankit
3   ankit
4  bardan
5   bipin
6    dsaf
7      df
8     hrr

In [184]:
emp_df[emp_df['age']>30]

Empty DataFrame
Columns: [name, age, salary, address]
Index: []

In [186]:
emp_df.shape

(9, 4)

In [190]:
emp_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     9 non-null      object
 1   age      9 non-null      int64
 2   salary   9 non-null      int64
 3   address  9 non-null      object
dtypes: int64(2), object(2)
memory usage: 420.0+ bytes

In [192]:
emp_df.describe()

             age        salary
count   9.000000      9.000000
mean   13.111111  29811.111111
std     3.333333  20704.857186
min    12.000000   1000.000000
25%    12.000000   4000.000000
50%    12.000000  40700.000000
75%    12.000000  45000.000000
max    22.000000  46000.000000

In [197]:
df=pd.read_csv('mt_everest.csv')#csv=comma seperated value

In [199]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5301 entries, 0 to 5300
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   _id               5301 non-null   int64
 1   NAME              5301 non-null   object
 2   COUNTRY           5301 non-null   object
 3   DAY               5301 non-null   int64
 4   MONTH             5301 non-null   int64
 5   YEAR              5301 non-null   int64
 6   ROUTE             2692 non-null   object
 7   NAME OF THE TEAM  5208 non-null   object
 8   LEADER            5172 non-null   object
dtypes: int64(4), object(5)
memory usage: 372.9+ KB

In [201]:
df.describe()

               _id          DAY        MONTH         YEAR
count  5301.000000  5301.000000  5301.000000  5301.000000
mean   2651.000000    19.540841     5.251651  2007.150915
std    1530.411219     5.384541     1.171380     9.323426
min       1.000000     1.000000     1.000000  1953.000000
25%    1326.000000    17.000000     5.000000  2004.000000
50%    2651.000000    20.000000     5.000000  2009.000000
75%    3976.000000    23.000000     5.000000  2013.000000
max    5301.000000    31.000000    12.000000  2088.000000

In [203]:
df.head()

,_id,NAME,COUNTRY,DAY,MONTH,YEAR,ROUTE,NAME OF THE TEAM,LEADER
0,1,TENZING NORGAY,NEPAL,29,5,1953,SOUTHCOL,BRITISH EXPEDITION,Lord John Hunt
1,2,EDMUND HILLARY,NEW ZEALAND,29,5,1953,SOUTHCOL,BRITISH EXPEDITION,""""
2,3,ERNST SCHMIED,SWITZERLAND,23,5,1956,SOUTHCOL,SWITZERLAND EXPEDITION,Alber Eggler
3,4,JUERGE MARMET,SWITZERLAND,23,5,1956,SOUTHCOL,SWITZERLAND EXPEDITION,""""
4,5,ADOLF REIST,SWITZERLAND,24,5,1956,SOUTHCOL,SWITZERLAND EXPEDITION,""""

In [211]:
name,age,roll
"Hari",30,12
'Ram',20,13

NameError: name 'name' is not defined

In [217]:
new_df=pd.read_csv('mt_everest.csv')

In [241]:
#create a function which takes _id and df as arguments and returns corresponding name
df.head()

,_id,NAME,COUNTRY,DAY,MONTH,YEAR,ROUTE,NAME OF THE TEAM,LEADER
0,1,TENZING NORGAY,NEPAL,29,5,1953,SOUTHCOL,BRITISH EXPEDITION,Lord John Hunt
1,2,EDMUND HILLARY,NEW ZEALAND,29,5,1953,SOUTHCOL,BRITISH EXPEDITION,""""
2,3,ERNST SCHMIED,SWITZERLAND,23,5,1956,SOUTHCOL,SWITZERLAND EXPEDITION,Alber Eggler
3,4,JUERGE MARMET,SWITZERLAND,23,5,1956,SOUTHCOL,SWITZERLAND EXPEDITION,""""
4,5,ADOLF REIST,SWITZERLAND,24,5,1956,SOUTHCOL,SWITZERLAND EXPEDITION,""""

In [227]:
df[df['_id']==3]['NAME'].iloc[0]#.loc[2]

'ERNST SCHMIED'

In [229]:
df.tail()

,_id,NAME,COUNTRY,DAY,MONTH,YEAR,ROUTE,NAME OF THE TEAM,LEADER
5296,5297,MR. PEMBA RITA SHERPA,NEPAL,27,5,2017,NaN,"""",""""
5297,5298,MR. PASANG GYALZEN,NEPAL,27,5,2017,NaN,NaN,NaN
5298,5299,MR. MINGMA DORJI SHERPA,NEPAL,16,5,2017,NaN,"""",""""
5299,5300,MR. DAWA SANGE SHERPA,NEPAL,21,5,2017,NaN,"""",""""
5300,5301,MR. PASANG BHOTE,NEPAL,21,5,2017,NaN,"""",""""

In [239]:
df[df['_id']==5300]['NAME'].loc[5299]

'MR. DAWA SANGE SHERPA'

In [245]:
df['YEAR'].unique()

array([1953, 1956, 1960, 1963, 1965, 1970, 1973, 1975, 1976, 1977, 1978,
       1979, 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1988, 1998, 1989,
       1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1999, 2000, 2001,
       2002, 2003, 2004, 2005, 2006, 2007, 2008, 2088, 2009, 2010, 2011,
       2012, 2013, 2014, 2016, 2017], dtype=int64)

In [255]:
#create a df of 2017 only
df[df['YEAR']==2017]

,_id,NAME,COUNTRY,DAY,MONTH,YEAR,ROUTE,NAME OF THE TEAM,LEADER
4878,4879,DALLAS WILSON GLASS,USA,22,5,2017,NaN,2017 IMG EVEREST\nEXPEDITION I,Dallas Wilson\nGlass
4879,4880,JAMES MICHAEL DAVIDSON,USA,22,5,2017,NaN,"""",""""
4880,4881,BRADLEY KEITH JONES,USA,22,5,2017,NaN,"""",""""
4881,4882,DAVID WILLIAM BUCHWALD,USA,22,5,2017,NaN,"""",""""
4882,4883,PATRICK GERARD MAURO II,USA,25,5,2017,NaN,"""",""""
...,...,...,...,...,...,...,...,...,...
5296,5297,MR. PEMBA RITA SHERPA,NEPAL,27,5,2017,NaN,"""",""""
5297,5298,MR. PASANG GYALZEN,NEPAL,27,5,2017,NaN,NaN,NaN
5298,5299,MR. MINGMA DORJI SHERPA,NEPAL,16,5,2017,NaN,"""",""""
5299,5300,MR. DAWA SANGE SHERPA,NEPAL,21,5,2017,NaN,"""",""""
5300,5301,MR. PASANG BHOTE,NEPAL,21,5,2017,NaN,"""",""""

In [291]:
df_2017=df[df['YEAR']==2017]

In [293]:
df_2017

,_id,NAME,COUNTRY,DAY,MONTH,YEAR,ROUTE,NAME OF THE TEAM,LEADER
4878,4879,DALLAS WILSON GLASS,USA,22,5,2017,NaN,2017 IMG EVEREST\nEXPEDITION I,Dallas Wilson\nGlass
4879,4880,JAMES MICHAEL DAVIDSON,USA,22,5,2017,NaN,"""",""""
4880,4881,BRADLEY KEITH JONES,USA,22,5,2017,NaN,"""",""""
4881,4882,DAVID WILLIAM BUCHWALD,USA,22,5,2017,NaN,"""",""""
4882,4883,PATRICK GERARD MAURO II,USA,25,5,2017,NaN,"""",""""
...,...,...,...,...,...,...,...,...,...
5296,5297,MR. PEMBA RITA SHERPA,NEPAL,27,5,2017,NaN,"""",""""
5297,5298,MR. PASANG GYALZEN,NEPAL,27,5,2017,NaN,NaN,NaN
5298,5299,MR. MINGMA DORJI SHERPA,NEPAL,16,5,2017,NaN,"""",""""
5299,5300,MR. DAWA SANGE SHERPA,NEPAL,21,5,2017,NaN,"""",""""
5300,5301,MR. PASANG BHOTE,NEPAL,21,5,2017,NaN,"""",""""

In [297]:
df_2017.describe().loc['count'].loc['_id']

423.0

In [299]:
len(df_2017['NAME'].unique())

403

In [309]:
#print countries name from where climbers belong in 2010
df_2010=df[df['YEAR']==2010]['COUNTRY'].unique()

In [311]:
df_2010

array(['USA', 'NEPAL', 'POLAND', 'ICELAND', 'INDIA', 'MEXICO', 'FINLAND',
       'UK', 'SOUTH KOREA', 'CANADA', 'NEW ZEALAND', 'SOUTH AFRICA',
       'AUSTRIA', 'SWITZERLAND', 'NORWAY', 'ITALY', 'JAPAN', 'PORTUGAL',
       'AUSTRALIA', 'FRANCE', 'SPAIN', 'COLOMBIA', 'GUATEMALA',
       'ARGENTINA', 'GERMANY', 'IRELAND', 'OMAN', 'TURKEY', 'SINGAPORE',
       'CHINA', 'DENMARK', 'CZECH REPUBLIC', 'MALTA', 'BRAZIL', 'HUNGARY'],
      dtype=object)

In [313]:
data

{'Name': ['Ram', 'Hari', 'shyam'],
 'Age': [25, 30, 35],
 'city': ['kathmandu', 'pakhara', 'biratnagar']}

In [315]:
df=pd.DataFrame(data)

In [317]:
df

    Name  Age        city
0    Ram   25   kathmandu
1   Hari   30     pakhara
2  shyam   35  biratnagar

In [319]:
df['salary']=[1200,12340,43500]

In [321]:
df

    Name  Age        city  salary
0    Ram   25   kathmandu    1200
1   Hari   30     pakhara   12340
2  shyam   35  biratnagar   43500

In [323]:
grouped_df=df.groupby('city')['Age'].mean()

In [325]:
grouped_df

city
biratnagar    35.0
kathmandu     25.0
pakhara       30.0
Name: Age, dtype: float64

In [338]:
df=pd.read_csv('demo_csv.csv',sep=';')

In [342]:
df

    Name  Age       City
0    Ram   25  Kathmandu
1   Hari   30    Pokhara
2  Shyam   35  Kathmandu

In [340]:
df.columns

Index(['Name', 'Age', 'City'], dtype='object')

In [352]:
df=pd.read_csv('demo_csv.csv',sep='$')

In [354]:
df

    Name  Age       City
0    Ram   25  Kathmandu
1   Hari   30    Pokhara
2  Shyam   35  Kathmandu

In [360]:
df_excel=pd.read_excel('sample.xlsx',sheet_name='Sheet1')

In [362]:
df_excel

    Name  Age       City
0    Ram   25  Kathmandu
1   Hari   30    Pokhara
2  Shyam   35  Kathmandu

In [364]:
df_excel=pd.read_excel('sample.xlsx',sheet_name='hello')

In [366]:
df_excel

    Name  Age       City
0    Ram   25  Kathmandu
1   Hari   30    Pokhara
2  Shyam   35  Kathmandu
3  Binod   55  ramechhap

In [370]:
df_json=pd.read_JSON('sample.json')

AttributeError: module 'pandas' has no attribute 'read_JSON'

In [376]:
df_clipboard=pd.read_clipboard()

In [378]:
df_clipboard

    Name  Age       City
0    Ram   25  Kathmandu
1   Hari   30    Pokhara
2  Shyam   35  Kathmandu
3  Binod   55  ramechhap